export const AreaMark: Record<string, string[]> = {
  JP: ['日本'],
  KR: ['韩国'],
  // 美洲
  US: [
    '加拿大',
    '美国',
    '墨西哥',
    '危地马拉',
    '伯利兹',
    '萨尔瓦多',
    '洪都拉斯',
    '尼加拉瓜',
    '哥斯达黎加',
    '巴拿马',
    '巴哈马',
    '古巴',
    '牙买加',
    '海地',
    '多米尼加',
    '圣基茨和尼维斯',
    '安提瓜和巴布达',
    '多米尼克',
    '圣卢西亚',
    '圣文森特和格林纳丁斯',
    '巴巴多斯',
    '格林纳达',
    '特立尼达和多巴哥',
    '哥伦比亚',
    '委内瑞拉',
    '圭亚那',
    '苏里南',
    '厄瓜多尔',
    '秘鲁',
    '巴西',
    '玻利维亚',
    '智利',
    '巴拉圭',
    '乌拉圭',
    '阿根廷'
  ],
  // 非洲
  AF: [
    '苏丹',
    '南苏丹',
    '埃塞俄比亚',
    '厄立特里亚',
    '索马里',
    '吉布提',
    '肯尼亚',
    '坦桑尼亚',
    '乌干达',
    '塞舌尔',
    '卢旺达',
    '布隆迪',
    '毛里塔尼亚',
    '塞内加尔',
    '冈比亚',
    '马里',
    '布基纳法索',
    '几内亚',
    '几内亚比绍',
    '佛得角',
    '塞拉利昂',
    '利比里亚',
    '科特迪瓦',
    '加纳',
    '多哥',
    '贝宁',
    '尼日尔',
    '尼日利亚',
    '乍得',
    '中非',
    '喀麦隆',
    '赤道几内亚',
    '加蓬',
    '刚果（布）',
    '刚果（金）',
    '圣多美和普林西比',
    '博茨瓦纳',
    '纳米比亚',
    '安哥拉',
    '南非',
    '斯威士兰',
    '莱索托',
    '马达加斯加',
    '马拉维',
    '科摩罗',
    '毛里求斯',
    '莫桑比克',
    '赞比亚',
    '津巴布韦'
  ],
  // 亚洲
  AS: [
    '乌兹别克斯坦',
    '吉尔吉斯斯坦',
    '土库曼斯坦',
    '塔吉克斯坦',
    '哈萨克斯坦',
    '蒙古',
    '朝鲜',
    '香港',
    '台湾',
    '澳门',
    '尼泊尔',
    '不丹',
    '印度',
    '巴基斯坦',
    '孟加拉国',
    '斯里兰卡',
    '马尔代夫',
    '阿富汗'
  ],
  // 东南亚
  SEA: ['越南', '老挝', '柬埔寨', '泰国', '缅甸', '马来西亚', '新加坡', '印度尼西亚', '文莱', '菲律宾', '东帝汶'],
  // 中东地区
  ME: [
    '巴林',
    '埃及',
    '伊朗',
    '土耳其',
    '伊拉克',
    '以色列',
    '约旦',
    '科威特',
    '黎巴嫩',
    '阿曼',
    '卡塔尔',
    // '沙特阿拉伯（简称沙特）',
    '沙特阿拉伯',
    '叙利亚',
    // '阿拉伯联合酋长国（简称阿联酋）',
    '阿拉伯联合酋长国',
    '也门',
    '巴勒斯坦',
    '阿尔及利亚',
    '利比亚',
    '摩洛哥',
    '突尼斯',
    '塞浦路斯',
    '格鲁吉亚',
    '亚美尼亚',
    '阿塞拜疆'
  ],
  //大洋洲
  OA: [
    '澳大利亚',
    '新西兰',
    '巴布亚新几内亚',
    '斐济',
    '基里巴斯',
    '马绍尔群岛',
    '密克罗尼西亚联邦',
    '瑙鲁',
    '帕劳',
    '萨摩亚',
    '所罗门群岛',
    '汤加',
    '图瓦卢',
    '瓦努阿图',
    '纽埃',
    '库克群岛'
  ],
  // 欧洲所有
  EU: [
    '英国',
    '爱尔兰',
    '荷兰',
    '比利时',
    '卢森堡',
    '法国',
    '摩纳哥',
    '德国',
    '奥地利',
    '瑞士',
    '西班牙',
    '葡萄牙',
    '挪威',
    '瑞典',
    '芬兰',
    '丹麦',
    '冰岛',
    '波兰',
    '捷克',
    '斯洛伐克',
    '匈牙利',
    '列支敦士登',
    '罗马尼亚',
    '保加利亚',
    '塞尔维亚',
    '黑山',
    '克罗地亚',
    '斯洛文尼亚',
    '波斯尼亚和黑塞哥维那',
    '北马其顿',
    '阿尔巴尼亚',
    '希腊',
    '意大利',
    '圣马力诺',
    '梵蒂冈',
    '安道尔',
    '马耳他',
    '俄罗斯',
    '白俄罗斯',
    '乌克兰',
    '爱沙尼亚',
    '拉脱维亚',
    '立陶宛',
    '摩尔多瓦'
  ]
}

// 业务伙伴问号提示语
export const AreaIconList = [
  {
    row1: {
      title: 'JP',
      color: '#EA3553',
      tooltip: '日本'
    },
    row2: {
      title: 'OA',
      color: '#825ECF',
      tooltip: '大洋洲'
    }
  },
  {
    row1: {
      title: 'KR',
      color: '#42A4F4',
      tooltip: '韩国'
    },
    row2: {
      title: 'AF',
      color: '#82A2AD',
      tooltip: '非洲'
    }
  },
  {
    row1: {
      title: 'US',
      color: '#42BF39',
      tooltip: '美洲'
    },
    row2: {
      title: 'AS',
      color: '#13B3A8',
      tooltip: '亚洲'
    }
  },
  {
    row1: {
      title: 'EU',
      color: '#E59500',
      tooltip: '欧洲'
    },
    row2: {
      title: 'SEA',
      color: '#C039B5',
      tooltip: '东南亚'
    }
  },
  {
    row1: {
      title: 'SA',
      color: '#A6179F',
      tooltip: '南美洲'
    },
    row2: {
      title: 'ME',
      color: '#F8F8B5',
      tooltip: '中东'
    }
  }
]
